/*
#############################################################################################
# Smite (9.3.7020.3) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TgClient_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_DCCLAN_MAX_MEMBERS                                 1000
#define CONST_CLAN_RANK_GROUP                                    96
#define CONST_MAX_BROWSER_TEXTURES                               12
#define CONST_RATATOSKR_BOT_ID                                   2063
#define CONST_RATATOSKR_ACORN_DEVICE_ID                          18703
#define CONST_RECOMMEND_ITEM_CATEGORY_STARTER                    10772
#define CONST_STORE_HEAD_COUNT                                   4
#define CONST_STORE_LIST_COUNT                                   12

	PMA_None                                           = 0,
	PMA_SelectTab                                      = 1,
	PMA_Search                                         = 2,
	PMA_Invite                                         = 3,
	PMA_ViewProfile                                    = 4,
	PMA_PromoteLeader                                  = 5,
	PMA_PromoteInvite                                  = 6,
	PMA_Kick                                           = 7,
	PMA_Leave                                          = 8,
	PMA_UpdateInviteList                               = 9,
	PMA_InviteListToggle                               = 10,
	PMA_UpdateTab                                      = 11,
	PMA_UpdateInviteListDisabled                       = 12,
	PMA_MAX                                            = 13
};*/

// Enum TgClient.TgGfxPlayerProfile.EPlayerProfileFilter
/*enum EPlayerProfileFilter
{
	PPF_YOURSELF                                       = 0,
	PPF_FRIENDS                                        = 1,
	PPF_CLAN                                           = 2,
	PPF_RECENTLY_PLAYED                                = 3,
	PPF_MAX                                            = 4
};*/

// Enum TgClient.TgGfxPlayerProfile.EPlayerProfileTab
/*enum EPlayerProfileTab
{
	PPT_OVERVIEW                                       = 0,
	PPT_MATCHES                                        = 1,
	PPT_GODS                                           = 2,
	PPT_RECORDS                                        = 3,
	PPT_MAX                                            = 4
};*/

// Enum TgClient.TgGfxProfileWorshiper.EGodMasteryFilter
/*enum EGodMasteryFilter
{
	GMS_ALL                                            = 0,
	GMS_MASTERED                                       = 1,
	GMS_IN_PROGRESS                                    = 2,
	GMS_NOT_MASTERED                                   = 3,
	GMS_NOT_PLAYED                                     = 4,
	GMS_MAX                                            = 5
};*/

// Enum TgClient.TgGfxRacerDispatcher.TgRacerDispatcherEvent
/*enum TgRacerDispatcherEvent
{
	TGRDE_PlacementChange                              = 0,
	TGRDE_WeaponChange                                 = 1,
	TGRDE_LapChange                                    = 2,
	TGRDE_MAX                                          = 3
};*/

// Enum TgClient.TgGfxStoreChestPC.EStoreChestPCActions
/*enum EStoreChestPCActions
{
	ESCPCA_None                                        = 0,
	ESCPCA_ItemUnlock                                  = 1,
	ESCPCA_RefreshItems                                = 2,
	ESCPCA_ChestIndex                                  = 3,
	ESCPCA_MAX                                         = 4
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class TgClient.TgGameLaunch
// 0x0000 (0x03B8 - 0x03B8)
class ATgGameLaunch : public ATgGameLaunchBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5282 );

		return pClassPointer;
	};

};

UClass* ATgGameLaunch::pClassPointer = NULL;

// Class TgClient.TgGameViewportClient
// 0x0000 (0x014C - 0x014C)
class UTgGameViewportClient : public UTgGameViewportClientBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5283 );

		return pClassPointer;
	};

};

UClass* UTgGameViewportClient::pClassPointer = NULL;

// Class TgClient.TgGfxAchievementPopup
// 0x0000 (0x01E0 - 0x01E0)
class UTgGfxAchievementPopup : public UTgGfxScene
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5284 );

		return pClassPointer;
	};

	void eventQueueAchievement ( );
	void asc_QueueAchievement ( );
	void Initialize ( class UTgMoviePlayer* pMoviePlayer );
};

UClass* UTgGfxAchievementPopup::pClassPointer = NULL;

// Class TgClient.TgGfxAchievementSelection
// 0x0010 (0x01F0 - 0x01E0)
class UTgGfxAchievementSelection : public UTgGfxScene
{
public:
	int                                                m_requestedPlayerId;                              		// 0x01E0 (0x0004) [0x0000000000000000]              
	struct FScriptDelegate                             __USC_ApplySelections_Delegate__Delegate;         		// 0x01E4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5285 );

		return pClassPointer;
	};

	void eventUpdateSelectedAchievements ( );
	void ASC_UpdateSelectedAchievements ( );
	void eventUpdateScreen ( );
	void ASC_UpdateScreen ( );
	void USC_ApplySelections ( int as1, int as2, int as3, int as4 );
	void USC_ApplySelections_Delegate ( int as1, int as2, int as3, int as4 );
	void Uninitialize ( );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxAchievementSelection::pClassPointer = NULL;

// Class TgClient.TgGfxAdventureProgress
// 0x0008 (0x01E8 - 0x01E0)
class UTgGfxAdventureProgress : public UTgGfxScene
{
public:
	int                                                m_nActivityId;                                    		// 0x01E0 (0x0004) [0x0000000000000000]              
	int                                                m_nVictoryLaps;                                   		// 0x01E4 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5286 );

		return pClassPointer;
	};

	void OnAcquisition ( class UTgEventDataItem* pEvent );
	void Uninitialize ( );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxAdventureProgress::pClassPointer = NULL;

// Class TgClient.TgGfxAdventureProgressDungeon2
// 0x0014 (0x01F4 - 0x01E0)
class UTgGfxAdventureProgressDungeon2 : public UTgGfxScene
{
public:
	int                                                m_nActivityId;                                    		// 0x01E0 (0x0004) [0x0000000000000000]              
	int                                                m_nBundleId;                                      		// 0x01E4 (0x0004) [0x0000000000000000]              
	int                                                m_nStatueActivityId;                              		// 0x01E8 (0x0004) [0x0000000000000000]              
	int                                                m_nStatueGoalId;                                  		// 0x01EC (0x0004) [0x0000000000000000]              
	int                                                m_nStatueCompleteGoalId;                          		// 0x01F0 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5287 );

		return pClassPointer;
	};

	void OnAcquisition ( class UTgEventDataItem* pEvent );
	void Uninitialize ( );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxAdventureProgressDungeon2::pClassPointer = NULL;

// Class TgClient.TgGfxAdventureProgressFox
// 0x0034 (0x0214 - 0x01E0)
class UTgGfxAdventureProgressFox : public UTgGfxScene
{
public:
	int                                                m_nActivityId;                                    		// 0x01E0 (0x0004) [0x0000000000000000]              
	int                                                m_nBundleId;                                      		// 0x01E4 (0x0004) [0x0000000000000000]              
	int                                                m_nChestItemId;                                   		// 0x01E8 (0x0004) [0x0000000000000000]              
	int                                                m_nPointBundleId;                                 		// 0x01EC (0x0004) [0x0000000000000000]              
	int                                                m_nFox1LTI;                                       		// 0x01F0 (0x0004) [0x0000000000000000]              
	int                                                m_nFox2LTI;                                       		// 0x01F4 (0x0004) [0x0000000000000000]              
	int                                                m_nFox3LTI;                                       		// 0x01F8 (0x0004) [0x0000000000000000]              
	int                                                m_nFox4LTI;                                       		// 0x01FC (0x0004) [0x0000000000000000]              
	int                                                m_nFox1ItemId;                                    		// 0x0200 (0x0004) [0x0000000000000000]              
	int                                                m_nFox2ItemId;                                    		// 0x0204 (0x0004) [0x0000000000000000]              
	int                                                m_nFox3ItemId;                                    		// 0x0208 (0x0004) [0x0000000000000000]              
	int                                                m_nFox4ItemId;                                    		// 0x020C (0x0004) [0x0000000000000000]              
	unsigned long                                      b_chestPurchaseLock : 1;                          		// 0x0210 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      b_requestedChestPurchase : 1;                     		// 0x0210 (0x0004) [0x0000000000000000] [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5288 );

		return pClassPointer;
	};

	void OnAcquisition ( class UTgEventDataItem* pEvent );
	void SetupChestPurchaseFox ( );
	void Uninitialize ( );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxAdventureProgressFox::pClassPointer = NULL;

// Class TgClient.TgGfxAdventureProgressMMO
// 0x0008 (0x01E8 - 0x01E0)
class UTgGfxAdventureProgressMMO : public UTgGfxScene
{
public:
	int                                                m_nActivityId;                                    		// 0x01E0 (0x0004) [0x0000000000000000]              
	int                                                m_nBundleId;                                      		// 0x01E4 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5289 );

		return pClassPointer;
	};

	void OnAcquisition ( class UTgEventDataItem* pEvent );
	void Uninitialize ( );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxAdventureProgressMMO::pClassPointer = NULL;

// Class TgClient.TgGfxAdventuresHub
// 0x0064 (0x0244 - 0x01E0)
class UTgGfxAdventuresHub : public UTgGfxScene
{
public:
	int                                                m_nBundleId;                                      		// 0x01E0 (0x0004) [0x0000000000000000]              
	int                                                m_nChestItemId;                                   		// 0x01E4 (0x0004) [0x0000000000000000]              
	int                                                m_nPointBundleLTI;                                		// 0x01E8 (0x0004) [0x0000000000000000]              
	unsigned long                                      b_chestPurchaseLock : 1;                          		// 0x01EC (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      b_requestedChestPurchase : 1;                     		// 0x01EC (0x0004) [0x0000000000000000] [0x00000002] 
	int                                                m_nCurrentQueueId;                                		// 0x01F0 (0x0004) [0x0000000000000000]              
	int                                                m_nChestLTI;                                      		// 0x01F4 (0x0004) [0x0000000000000000]              
	int                                                m_nPointLTI;                                      		// 0x01F8 (0x0004) [0x0000000000000000]              
	int                                                m_nItemLTI1;                                      		// 0x01FC (0x0004) [0x0000000000000000]              
	int                                                m_nItemLTI2;                                      		// 0x0200 (0x0004) [0x0000000000000000]              
	int                                                m_nItemLTI3;                                      		// 0x0204 (0x0004) [0x0000000000000000]              
	int                                                m_nItemLTI4;                                      		// 0x0208 (0x0004) [0x0000000000000000]              
	int                                                m_nCurrentAdventureItem;                          		// 0x020C (0x0004) [0x0000000000000000]              
	int                                                m_nActivityId;                                    		// 0x0210 (0x0004) [0x0000000000000000]              
	struct FScriptDelegate                             __USC_SetUserViewedEvent_Delegate__Delegate;      		// 0x0214 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __USC_GetAdventureLeaderboard_Delegate__Delegate; 		// 0x0220 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __USC_GotoVault_Delegate__Delegate;               		// 0x022C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __USC_OpenEventCam_Delegate__Delegate;            		// 0x0238 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5290 );

		return pClassPointer;
	};

	void eventSceneTick ( float Delta );
	void OnAcquisition ( class UTgEventDataItem* pEvent );
	void SetBundleOwnership ( );
	void TriggerLobbyEventHub ( int nType, int nTarget );
	void TriggerLobbyCamEvent ( int nType, int nTarget );
	void Uninitialize ( );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Initialize ( class UTgMoviePlayer* theMovie );
	void LeaveQueue ( );
	void PopulateGoalData ( );
	void USC_OpenEventCam ( unsigned long isSmall );
	void USC_GotoVault ( unsigned long bIsSmall );
	void USC_SetUserViewedEvent ( );
	void USC_GetAdventureLeaderboard ( int nEventId );
	void USC_OpenEventCam_Delegate ( );
	void USC_GotoVault_Delegate ( );
	void USC_GetAdventureLeaderboard_Delegate ( );
	void USC_SetUserViewedEvent_Delegate ( );
};

UClass* UTgGfxAdventuresHub::pClassPointer = NULL;

// Class TgClient.TgGfxBooster
// 0x000C (0x01EC - 0x01E0)
class UTgGfxBooster : public UTgGfxScene
{
public:
	struct FScriptDelegate                             __USC_ShowPurchasePopup_Delegate__Delegate;       		// 0x01E0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5291 );

		return pClassPointer;
	};

	void UpdateBoosterTime ( );
	void USC_ShowPurchasePopup ( int ItemId, int nQuantity );
	void USC_ShowPurchasePopup_Delegate ( int ItemId, int nQuantity );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxBooster::pClassPointer = NULL;

// Class TgClient.TgGfxCharacterBuilder
// 0x0C40 (0x0E20 - 0x01E0)
class UTgGfxCharacterBuilder : public UTgGfxScene
{
public:
	struct FString                                     m_lsItems;                                        		// 0x01E0 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsActives;                                      		// 0x01EC (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsConsumables;                                  		// 0x01F8 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsPassive;                                      		// 0x0204 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsActivated;                                    		// 0x0210 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsAbilities;                                    		// 0x021C (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsSkip;                                         		// 0x0228 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsSaveItems;                                    		// 0x0234 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsSaveAbilities;                                		// 0x0240 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	int                                                m_playerClassId;                                  		// 0x024C (0x0004) [0x0000000000000000]              
	int                                                m_nSelectedTab;                                   		// 0x0250 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_Tabs[ 0x2 ];                                    		// 0x0254 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_SaveButton;                                     		// 0x025C (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_ClearButton;                                    		// 0x0260 (0x0004) [0x0000000000000000]              
	int                                                m_nSelectedItem;                                  		// 0x0264 (0x0004) [0x0000000000000000]              
	int                                                m_nHighlightIndex;                                		// 0x0268 (0x0004) [0x0000000000000000]              
	int                                                m_nItemScrollIndex;                               		// 0x026C (0x0004) [0x0000000000000000]              
	TArray< struct FItemBuilderCategory >              m_Categories;                                     		// 0x0270 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FItemBuilderCategory >              m_CustomCategories;                               		// 0x027C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      m_ShownList;                                      		// 0x0288 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      m_ShownGrid;                                      		// 0x0294 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_nRoleIndex;                                     		// 0x02A0 (0x0004) [0x0000000000000000]              
	unsigned char                                      m_TipType;                                        		// 0x02A4 (0x0001) [0x0000000000000000]              
	int                                                m_nPreviewTipIndex;                               		// 0x02A8 (0x0004) [0x0000000000000000]              
	float                                              m_fTipWaitTimer;                                  		// 0x02AC (0x0004) [0x0000000000000000]              
	float                                              m_fTipWaitDuration;                               		// 0x02B0 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bIsCustomRole : 1;                              		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bIsSubFilter : 1;                               		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bProfileModified : 1;                           		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      m_bAbilitiesModified : 1;                         		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000008] 
	int                                                m_nCustomRoleIndex;                               		// 0x02B8 (0x0004) [0x0000000000000000]              
	TArray< struct FPreviewItem >                      m_PreviewItemData;                                		// 0x02BC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FPreviewItem >                      m_PreviewActiveData;                              		// 0x02C8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FPreviewItem >                      m_PreviewConsumableData;                          		// 0x02D4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_nFilterIndex;                                   		// 0x02E0 (0x0004) [0x0000000000000000]              
	int                                                m_nFocusedItemIndex;                              		// 0x02E4 (0x0004) [0x0000000000000000]              
	int                                                m_nFocusedItemCategory;                           		// 0x02E8 (0x0004) [0x0000000000000000]              
	int                                                m_bIsFocusingGridItem;                            		// 0x02EC (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_ItemView;                                       		// 0x02F0 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_BuildPreview;                                   		// 0x02F4 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_RoleDropDown;                                   		// 0x02F8 (0x0004) [0x0000000000000000]              
	struct FItemDisplay                                m_ListItem[ 0xC ];                                		// 0x02FC (0x0300) [0x0000000000000000]              
	struct FItemDisplay                                m_GridItem[ 0x10 ];                               		// 0x05FC (0x0400) [0x0000000000000000]              
	class UTgGFxObject*                                m_Header[ 0x4 ];                                  		// 0x09FC (0x0010) [0x0000000000000000]              
	class UTgGFxObject*                                m_HeaderTF[ 0x4 ];                                		// 0x0A0C (0x0010) [0x0000000000000000]              
	class UTgGFxObject*                                m_HeaderBlock[ 0x4 ];                             		// 0x0A1C (0x0010) [0x0000000000000000]              
	struct FBuildItemDisplay                           m_PreviewItems[ 0x6 ];                            		// 0x0A2C (0x0030) [0x0000000000000000]              
	struct FBuildItemDisplay                           m_PreviewActives[ 0x2 ];                          		// 0x0A5C (0x0010) [0x0000000000000000]              
	struct FBuildItemDisplay                           m_PreviewConsumables[ 0x2 ];                      		// 0x0A6C (0x0010) [0x0000000000000000]              
	int                                                m_nSelectedLevel;                                 		// 0x0A7C (0x0004) [0x0000000000000000]              
	int                                                m_nSelectedAbility;                               		// 0x0A80 (0x0004) [0x0000000000000000]              
	struct FLevelInfo                                  m_nLevelAbilities[ 0x14 ];                        		// 0x0A84 (0x00A0) [0x0000000000000000]              
	int                                                m_nAbilityLevels[ 0x4 ];                          		// 0x0B24 (0x0010) [0x0000000000000000]              
	struct FString                                     m_AbilityIcons[ 0x4 ];                            		// 0x0B34 (0x0030) [0x0000000000500000]              ( CPF_NeedCtorLink )
	class UTgGFxObject*                                m_AbilityPreview;                                 		// 0x0B64 (0x0004) [0x0000000000000000]              
	struct FAbilitySelectionButton                     m_PreviewAbilities[ 0x5 ];                        		// 0x0B68 (0x00A0) [0x0000000000000000]              
	class UTgGFxObject*                                m_AbilitiesView;                                  		// 0x0C08 (0x0004) [0x0000000000000000]              
	struct FAbilitySelectionButton                     m_AbilityBtns[ 0x4 ];                             		// 0x0C0C (0x0080) [0x0000000000000000]              
	struct FAbilityRow                                 m_AbilityRows[ 0x14 ];                            		// 0x0C8C (0x0190) [0x0000000000000000]              
	class UTgGFxObject*                                m_AbilitySkip;                                    		// 0x0E1C (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5292 );

		return pClassPointer;
	};

	bool HasVendorData ( );
	class UTgVendorData* GetVendorData ( );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Uninitialize ( );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxCharacterBuilder::pClassPointer = NULL;

// Class TgClient.TgGfxClanIconPicker
// 0x000C (0x01EC - 0x01E0)
class UTgGfxClanIconPicker : public UTgGfxScene
{
public:
	struct FScriptDelegate                             __USC_SelectIcon_Delegate__Delegate;              		// 0x01E0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5293 );

		return pClassPointer;
	};

	void Initialize ( class UTgMoviePlayer* pMP );
	void USC_SelectIcon ( int nIconItemId );
	void USC_SelectIcon_Delegate ( );
};

UClass* UTgGfxClanIconPicker::pClassPointer = NULL;

// Class TgClient.TgGFxDungeonCurrencies
// 0x0000 (0x01E0 - 0x01E0)
class UTgGFxDungeonCurrencies : public UTgGfxScene
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5294 );

		return pClassPointer;
	};

	void Uninitialize ( );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGFxDungeonCurrencies::pClassPointer = NULL;

// Class TgClient.TgGfxEOMLobby
// 0x0010 (0x01F0 - 0x01E0)
class UTgGfxEOMLobby : public UTgGfxScene
{
public:
	struct FString                                     m_sGiftedPlayerName;                              		// 0x01E0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_nGiftedPlayerId;                                		// 0x01EC (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5295 );

		return pClassPointer;
	};

	void OnAcquisition ( class UTgEventDataItem* pEvent );
	void OnStats ( struct FString instanceId );
	void OnFeedback ( );
	void OnTwitter ( struct FString instanceId );
	void OnFacebook ( struct FString instanceId );
	void OnSendPlayerGift ( class UTgEventDataItem* pEvent );
	void OnSendGiftPoints ( class UGFxObject* pData );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void USC_SendPlayerGift ( struct FString PlayerName, struct FString nPlayerId );
	void eventReceiveGiftedPoints ( class UGFxObject* Data );
	void Uninitialize ( );
	void Initialize ( class UTgMoviePlayer* pMoviePlayer );
};

UClass* UTgGfxEOMLobby::pClassPointer = NULL;

// Class TgClient.TgGfxEventAchievements
// 0x0000 (0x01E0 - 0x01E0)
class UTgGfxEventAchievements : public UTgGfxScene
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5296 );

		return pClassPointer;
	};

	void CheckBundleOwned ( );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxEventAchievements::pClassPointer = NULL;

// Class TgClient.TgGfxEventLeaderboard
// 0x0018 (0x01F8 - 0x01E0)
class UTgGfxEventLeaderboard : public UTgGfxScene
{
public:
	unsigned long                                      requestingData : 1;                               		// 0x01E0 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      gotFriendsData : 1;                               		// 0x01E0 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      gotPersonalData : 1;                              		// 0x01E0 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      gotWorldData : 1;                                 		// 0x01E0 (0x0004) [0x0000000000000000] [0x00000008] 
	struct FString                                     dataIndex;                                        		// 0x01E4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                nCurrentEventId;                                  		// 0x01F0 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  cachedBoards;                                     		// 0x01F4 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5297 );

		return pClassPointer;
	};

	void USC_RequestEventLeaderboard ( int EventIdx );
	class UGFxObject* Chunk ( struct FString dataIdx );
	class UGFxObject* CreateChunk ( struct FString dataIdx );
	bool UpdateFromChunk ( struct FString dataIdx );
	void OnReceivePlayerNames ( );
	void ReceivedAllData ( );
	void PopulateDropdown ( TArray< int > arrEventIds );
	void ShowLeaderboard ( int nStartIndex, int nEndIndex );
	void RequestFriendAndWorldPlayerNames ( );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxEventLeaderboard::pClassPointer = NULL;

// Class TgClient.TgGfxFeedback
// 0x0074 (0x0254 - 0x01E0)
class UTgGfxFeedback : public UTgGfxScene
{
public:
	struct FString                                     m_lsHeaderServerStability;                        		// 0x01E0 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsHeaderMatchmaking;                            		// 0x01EC (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsDescriptionServerStability;                   		// 0x01F8 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsDescriptionMatchmaking;                       		// 0x0204 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsSubmit;                                       		// 0x0210 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsComments;                                     		// 0x021C (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsUnrated;                                      		// 0x0228 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	class UTgGFxObject*                                m_Comments;                                       		// 0x0234 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_RatingBtns[ 0x5 ];                              		// 0x0238 (0x0014) [0x0000000000000000]              
	class UTgGFxObject*                                m_RatingTF;                                       		// 0x024C (0x0004) [0x0000000000000000]              
	int                                                m_nStarRating;                                    		// 0x0250 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5298 );

		return pClassPointer;
	};

	void ReceiveGFxData ( class UGFxObject* pObj );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxFeedback::pClassPointer = NULL;

// Class TgClient.TgGfxGlossary
// 0x0000 (0x01E0 - 0x01E0)
class UTgGfxGlossary : public UTgGfxScene
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5299 );

		return pClassPointer;
	};

	void Uninitialize ( );
	void Initialize ( class UTgMoviePlayer* pMP );
	void ReceiveGFxData ( class UGFxObject* pObj );
};

UClass* UTgGfxGlossary::pClassPointer = NULL;

// Class TgClient.TgGfxGods
// 0x0D4C (0x0F2C - 0x01E0)
class UTgGfxGods : public UTgGfxScene
{
public:
	struct FString                                     m_lsStandard;                                     		// 0x01E0 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsOwned;                                        		// 0x01EC (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     rented_label;                                     		// 0x01F8 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsCurrentRentalExpiresIn;                       		// 0x0204 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsDiamond;                                      		// 0x0210 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsDiamond_description;                          		// 0x021C (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusive;                                    		// 0x0228 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusive_description;                        		// 0x0234 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveChest;                               		// 0x0240 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveChest_description;                   		// 0x024C (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveClan;                                		// 0x0258 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveClan_description;                    		// 0x0264 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusivePromo;                               		// 0x0270 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusivePromo_description;                   		// 0x027C (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveEsports;                             		// 0x0288 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveEsports_description;                 		// 0x0294 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveSeasonal;                            		// 0x02A0 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveSeasonal_description;                		// 0x02AC (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsGold;                                         		// 0x02B8 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsGold_description;                             		// 0x02C4 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLegendary;                                    		// 0x02D0 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLegendary_description;                        		// 0x02DC (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimited;                                      		// 0x02E8 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimited_description;                          		// 0x02F4 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedChest;                                 		// 0x0300 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedChest_description;                     		// 0x030C (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedClan;                                  		// 0x0318 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedClan_description;                      		// 0x0324 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedPromo;                                 		// 0x0330 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedPromo_description;                     		// 0x033C (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedEsports;                               		// 0x0348 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedEsports_description;                   		// 0x0354 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedSeasonal;                              		// 0x0360 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedSeasonal_description;                  		// 0x036C (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsUnlimited;                                    		// 0x0378 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsUnlimited_description;                        		// 0x0384 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsClan;                                         		// 0x0390 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     days_label;                                       		// 0x039C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     day_label;                                        		// 0x03A8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     hours_label;                                      		// 0x03B4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     hour_label;                                       		// 0x03C0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     minutes_label;                                    		// 0x03CC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     minute_label;                                     		// 0x03D8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     seconds_label;                                    		// 0x03E4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     second_label;                                     		// 0x03F0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      god_ids;                                          		// 0x03FC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FGFxItem                                    m_ItemBtn[ 0x38 ];                                		// 0x0408 (0x0460) [0x0000000000000000]              
	struct FGFxSkinBtn                                 m_SkinBtn[ 0x6 ];                                 		// 0x0868 (0x0150) [0x0000000000000000]              
	struct FGFxGodBtn                                  m_GodCardBtn[ 0x10 ];                             		// 0x09B8 (0x0340) [0x0000000000000000]              
	class UTgGFxObject*                                m_SearchField;                                    		// 0x0CF8 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_FilterDropdown;                                 		// 0x0CFC (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_GodGrid;                                        		// 0x0D00 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_GodCardCheckbox;                                		// 0x0D04 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_GodGridScrollbar;                               		// 0x0D08 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_GodCardScrollbar;                               		// 0x0D0C (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_UGPIconsBtn;                                    		// 0x0D10 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_UGPCardsBtn;                                    		// 0x0D14 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_SkinCall;                                       		// 0x0D18 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_SkinCallTF;                                     		// 0x0D1C (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_ExtraCall;                                      		// 0x0D20 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_ExtraCallTF;                                    		// 0x0D24 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_VoiceCall;                                      		// 0x0D28 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_VoiceCallTF;                                    		// 0x0D2C (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_VPContainer;                                    		// 0x0D30 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_SkinGoto;                                       		// 0x0D34 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_RentalInfo;                                     		// 0x0D38 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_SkinInfo;                                       		// 0x0D3C (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_SideSkinInfo;                                   		// 0x0D40 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_UnlockBtn;                                      		// 0x0D44 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_EmoteLabel;                                     		// 0x0D48 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_RightGodsText;                                  		// 0x0D4C (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_RightGodsText2;                                 		// 0x0D50 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_AbilityScreen;                                  		// 0x0D54 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_AboutScreen;                                    		// 0x0D58 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_LoreScreen;                                     		// 0x0D5C (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_StatScreen;                                     		// 0x0D60 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_ExtraScreen;                                    		// 0x0D64 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_HistoryScreen;                                  		// 0x0D68 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_VoiceScreen;                                    		// 0x0D6C (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_AchieveScreen;                                  		// 0x0D70 (0x0004) [0x0000000000000000]              
	int                                                m_nSelectedIndex;                                 		// 0x0D74 (0x0004) [0x0000000000000000]              
	int                                                m_nScrollIndex;                                   		// 0x0D78 (0x0004) [0x0000000000000000]              
	TArray< int >                                      m_nShownItems;                                    		// 0x0D7C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      m_nUnsortedItems;                                 		// 0x0D88 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      m_RentalGodsIndex;                                		// 0x0D94 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sSearchField;                                   		// 0x0DA0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sSearch;                                        		// 0x0DAC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              m_fTipWaitTimer;                                  		// 0x0DB8 (0x0004) [0x0000000000000000]              
	float                                              m_fTipWaitDuration;                               		// 0x0DBC (0x0004) [0x0000000000000000]              
	float                                              m_fRentalTimer;                                   		// 0x0DC0 (0x0004) [0x0000000000000000]              
	int                                                m_nHighlightIndex;                                		// 0x0DC4 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bScrollToSelection : 1;                         		// 0x0DC8 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bHasGodPack : 1;                                		// 0x0DC8 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bShouldUpdateCall : 1;                          		// 0x0DC8 (0x0004) [0x0000000000000000] [0x00000004] 
	int                                                m_nSelectedTab;                                   		// 0x0DCC (0x0004) [0x0000000000000000]              
	int                                                m_nSelectedGodId;                                 		// 0x0DD0 (0x0004) [0x0000000000000000]              
	int                                                m_nSelectedSkinId;                                		// 0x0DD4 (0x0004) [0x0000000000000000]              
	int                                                m_nSelectedWardSkinId;                            		// 0x0DD8 (0x0004) [0x0000000000000000]              
	int                                                m_nFilterType;                                    		// 0x0DDC (0x0004) [0x0000000000000000]              
	int                                                m_nPrevGodScrollIndex;                            		// 0x0DE0 (0x0004) [0x0000000000000000]              
	int                                                m_nPrevWardScrollIndex;                           		// 0x0DE4 (0x0004) [0x0000000000000000]              
	int                                                m_nStatsHPLow;                                    		// 0x0DE8 (0x0004) [0x0000000000000000]              
	int                                                m_nStatsHPHigh;                                   		// 0x0DEC (0x0004) [0x0000000000000000]              
	int                                                m_nStatsManaLow;                                  		// 0x0DF0 (0x0004) [0x0000000000000000]              
	int                                                m_nStatsManaHigh;                                 		// 0x0DF4 (0x0004) [0x0000000000000000]              
	int                                                m_nCachedGodsTabSelection;                        		// 0x0DF8 (0x0004) [0x0000000000000000]              
	int                                                m_playerId;                                       		// 0x0DFC (0x0004) [0x0000000000000000]              
	int                                                m_nColCount;                                      		// 0x0E00 (0x0004) [0x0000000000000000]              
	struct FItemData_GodPage                           m_SelectedGod;                                    		// 0x0E04 (0x00C4) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FItemData_GodPage >                 m_GodData;                                        		// 0x0EC8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FItemData_GodPage >                 m_WardData;                                       		// 0x0ED4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FItemData_GodPage >                 m_SkinData;                                       		// 0x0EE0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FStreamData_Gods >                  m_StreamData;                                     		// 0x0EEC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FAchievementData_GodsAchievements > m_achievementDatas;                               		// 0x0EF8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UGFxObject*                                  m_achievementDatasArray;                          		// 0x0F04 (0x0004) [0x0000000000000000]              
	TArray< struct FVendorItemUIHint >                 m_vendorUiHints;                                  		// 0x0F08 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __USC_UpdateEmoteSelection_Delegate__Delegate;    		// 0x0F14 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __USC_PlayGodVideo_Delegate__Delegate;            		// 0x0F20 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5300 );

		return pClassPointer;
	};

	void OnAcquisition ( class UTgEventDataItem* pEvent );
	void UpdateUGPValue ( class UTgEventDataItem* pEvent );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Uninitialize ( );
	void Initialize ( class UTgMoviePlayer* theMovie );
	void USC_PlayGodVideo ( int abilityNumber );
	void USC_PlayGodVideo_Delegate ( );
	void USC_UpdateEmoteSelection ( struct FString emoteName );
	void USC_UpdateEmoteSelection_Delegate ( struct FString emoteName );
};

UClass* UTgGfxGods::pClassPointer = NULL;

// Class TgClient.TgGfxGodsHistory
// 0x002C (0x020C - 0x01E0)
class UTgGfxGodsHistory : public UTgGfxScene
{
public:
	int                                                m_godId;                                          		// 0x01E0 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_updatedQueues : 1;                              		// 0x01E4 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FScriptDelegate                             __USC_GetQueuesDropdown_Delegate__Delegate;       		// 0x01E8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __USC_GetHistoryData_Delegate__Delegate;          		// 0x01F4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __USC_ShowMatchDetails_Delegate__Delegate;        		// 0x0200 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
